[{
  "name": "TDD",
  "description": "TDD is an art, do, not write a line of code before you have a failing test. This will help you make code that is better for your friends to live with.",
  "levelDescription": "Your current expertice is not enough, your tests should be lighter, faster and more stable, may be it is time to learn \"tape\".",
  "lectures": [{
    "name": "optimus",
    "url": "http://hackersome.com/p/vitorbritto/optimus"
  }, {
    "name": "WAT",
    "url": "https://www.destroyallsoftware.com/talks/wat"
  }]
}, {
  "name": "VanillaJS",
  "description": "JavaScript is the most popular programming language in the world. A proper understanding of it's good parts is desirable if you want to write maintainable, concise and usable code that will last forever.",
  "levelDescription": "You don't have to be an expert in VanillaJS but your understandig should be wide enough to be able to kick out jQuery.",
  "lectures": [{
    "name": "jQuery",
    "url": "https://github.com/jquery/jquery/blob/master/src/ajax.js"
  }, {
    "name": "Codecademy JavaScript Path",
    "url": "https://www.codecademy.com/tracks/javascript"
  }]
}, {
  "name": "Node",
  "description": "Node.js contributions, releases, and contributorship are under an open governance model. We intend to land, with increasing regularity, releases which are compatible with the npm ecosystem that has been built to date for Node.js.",
  "levelDescription": "Your current expertice is not enough.",
  "lectures": [{
    "name": "Node docs",
    "url": "https://nodejs.org/documentation/"
  }, {
    "name": "Github Node.js",
    "url": "https://github.com/nodejs/node"
  }]
}, {
  "name": "Discuss Dependencies",
  "description": "Frontend modules are awesome, but they can make the app really slow, so it is important to keep only the esentials.",
  "levelDescription": "At this level, you are expected to be able to discuss in a respectfull way with the client and with other devs the importance of each module.",
  "lectures": [{
    "name": "Manage those dependencies (slide)",
    "url": "https://speakerdeck.com/jakobmattsson/manage-those-dependencies"
  }]
}, {
  "name": "Angular",
  "description": "AngularJS lets you write client-side web applications as if you had a smarter browser. It lets you use good old HTML as your template language and lets you extend HTML’s syntax to express your application’s components clearly and succinctly.",
  "levelDescription": "At this point is expected that you be able to work with Angular without difficulties and with an advanced understanding of the framework.",
  "lectures": [{
    "name": "Angular docs",
    "url": "https://docs.angularjs.org/guide"
  }, {
    "name": "Github AngularJS",
    "url": "https://github.com/angular/angular.js"
  }]
}, {
  "name": "Scrum Master",
  "description": "Is an iterative and incremental agile software development methodology for managing product development. Scrum adopts an empirical approach—accepting that the problem cannot be fully understood or defined, focusing instead on maximizing the team's ability to deliver quickly and respond to emerging requirements.",
  "levelDescription": "This ability is not required for this position, but it will not hurt you if you read something about this skill.",
  "lectures": [{
    "name": "Wikipedia Scrum",
    "url": "https://en.wikipedia.org/wiki/Scrum_%28software_development%29"
  }]
}]
